{
  "updated_at": "2025-12-08T00:00:00Z",
  "reviews": [
    {
      "source": "toyoursuccess",
      "customer_name": "HUNTER KELLY",
      "review": "Would encourage anyone interested in or contemplating purchasing a RV to take a look at Norman Campers. They will answer each and every question or concern you have in a casual and comfortable atmosphere and treat you with the utmost respect. This business is family owned and operated and it shows from the start, you will be glad you made the visit whether you purchase or not!",
      "review_date": "2025-11-29 12:24:57",
      "rating": 5
    },
    {
      "source": "google",
      "customer_name": "Shaun Dobbs",
      "review": "Super friendly and knowledgeable staff. Very helpful when it came to our entire purchasing process from viewing the camper to bringing a unit home. No upcharges to get out the door. The starter package that Norman includes is great...it includes everything you need to get to camping right away. They also took time to inspect the travel trailer before we left with it to make sure everything was fully functional. Highly recommend!\n\nEdit - one year after ownership and I can still say the folks at Norman are great. I had a few minor warranty items to be resolved with my camper and Norman took care of them promptly!",
      "review_date": "2025-11-16 13:37:03",
      "rating": 5
    },
    {
      "source": "google",
      "customer_name": "chris astin",
      "review": "I wish I could give more stars. I had a leak behind the wall in my 2022 camper that was obviously a factory issue, but just recently discovered. After almost 4 years Tim and Ryan went to bat for me with the manufacturer and got my repairs 100% covered. I knew Tim was a man of his word, but he truly does care about his customers and doing the right thing! I 100% recommend them and Puma if you are shopping for a camper.",
      "review_date": "2025-10-23 16:11:17",
      "rating": 5
    },
    {
      "source": "google",
      "customer_name": "Jake Wright",
      "review": "Norman Campers is the only place I will take my motorhome for repairs. Ryan and the front office are always very nice and accommodating to my needs and time frames. You won’t get a more honest review of camping products and high quality selection. I trust no technician more than Justin to work on my motorhome. He is extremely knowledgeable and honest. There is a reason they always have a wait list for service. I expect perfection and he always delivers. Prices are by far the best in town.",
      "review_date": "2025-10-22 13:56:12",
      "rating": 5
    }
  ]
}
